In [1]:
import pandas as pd
import numpy as np

In [2]:
sales = pd.DataFrame({
    "Sales_id":[101,102,103,104,105,106,107,108,109,110],
    "Product_name": ["Pen","Pencil","Pen","Pencil","laptop","mobile","laptop","mobile","Pen","Pencil"],
    "Product_price":[10,15,10,15,100,np.nan,np.nan,150,10,15],
    "qty":[1,2,3,4,5,6,7,8,9,10]
})

In [3]:
sales

   Sales_id Product_name  Product_price  qty
0       101          Pen           10.0    1
1       102       Pencil           15.0    2
2       103          Pen           10.0    3
3       104       Pencil           15.0    4
4       105       laptop          100.0    5
5       106       mobile            NaN    6
6       107       laptop            NaN    7
7       108       mobile          150.0    8
8       109          Pen           10.0    9
9       110       Pencil           15.0   10

In [4]:
sales["total_amount"] = sales["Product_price"]* sales["qty"]

In [5]:
sales

   Sales_id Product_name  Product_price  qty  total_amount
0       101          Pen           10.0    1          10.0
1       102       Pencil           15.0    2          30.0
2       103          Pen           10.0    3          30.0
3       104       Pencil           15.0    4          60.0
4       105       laptop          100.0    5         500.0
5       106       mobile            NaN    6           NaN
6       107       laptop            NaN    7           NaN
7       108       mobile          150.0    8        1200.0
8       109          Pen           10.0    9          90.0
9       110       Pencil           15.0   10         150.0

In [6]:
hello = sales.groupby("Product_name") ["total_amount"].sum()

In [7]:
hello

Product_name
Pen        130.0
Pencil     240.0
laptop     500.0
mobile    1200.0
Name: total_amount, dtype: float64

In [8]:
sales.isnull().sum()

Sales_id         0
Product_name     0
Product_price    2
qty              0
total_amount     2
dtype: int64

In [9]:
sales["Product_price"]=sales["Product_price"].fillna(sales["Product_price"].mean())

In [53]:
sales["qty"]=sales["qty"].fillna(5)

In [10]:
sales["Product_price"]=sales["Product_price"].fillna(5)

In [11]:
sales.isnull().sum()

Sales_id         0
Product_name     0
Product_price    0
qty              0
total_amount     2
dtype: int64

In [13]:
sales

   Sales_id Product_name  Product_price  qty  total_amount
0       101          Pen         10.000    1          10.0
1       102       Pencil         15.000    2          30.0
2       103          Pen         10.000    3          30.0
3       104       Pencil         15.000    4          60.0
4       105       laptop        100.000    5         500.0
5       106       mobile         40.625    6           NaN
6       107       laptop         40.625    7           NaN
7       108       mobile        150.000    8        1200.0
8       109          Pen         10.000    9          90.0
9       110       Pencil         15.000   10         150.0

In [14]:
#  sales["qty"]=sales["Product_name"].fillna(method="ffill")

In [15]:
print(sales.dtypes)

Sales_id           int64
Product_name      object
Product_price    float64
qty                int64
total_amount     float64
dtype: object

In [16]:
sales["Sales_id"] = sales["Sales_id"].astype("object")

In [17]:
print (sales.dtypes)

Sales_id          object
Product_name      object
Product_price    float64
qty                int64
total_amount     float64
dtype: object

In [18]:
print(sales.dtypes)

Sales_id          object
Product_name      object
Product_price    float64
qty                int64
total_amount     float64
dtype: object

In [19]:
a = sales.groupby("Product_name")["total_amount"].sum()

In [20]:
sales["Sales_id"] = sales["Sales_id"].astype("object")

In [21]:
a = pd.DataFrame(a.reset_index())

In [22]:
b = sales.groupby("Product_name").agg({"total_amount":["sum","mean","max","min","count","std","var","median"]})

In [23]:
b = pd.DataFrame(b.reset_index())

In [24]:
b.columns = ["Product_name","total_amount_sum","mean","max","min","count","std","var","median"]

In [25]:
b

,Product_name,total_amount_sum,mean,max,min,count,std,var,median
0,Pen,130.0,43.333333,90.0,10.0,3,41.63332,1733.333333,30.0
1,Pencil,240.0,80.000000,150.0,30.0,3,62.44998,3900.000000,60.0
2,laptop,500.0,500.000000,500.0,500.0,1,NaN,NaN,500.0
3,mobile,1200.0,1200.000000,1200.0,1200.0,1,NaN,NaN,1200.0

In [27]:
print("-------",sales.dtypes)

------- Sales_id          object
Product_name      object
Product_price    float64
qty                int64
total_amount     float64
dtype: object

In [31]:
# pivot table
a = sales.pivot_table(index="Product_name", values="total_amount", aggfunc=["sum","mean","max","min","count"]).reset_index()

In [32]:
a

,Product_name,sum,mean,max,min,count
,,total_amount,total_amount,total_amount,total_amount,total_amount
0,Pen,130.0,43.333333,90.0,10.0,3
1,Pencil,240.0,80.000000,150.0,30.0,3
2,laptop,500.0,500.000000,500.0,500.0,1
3,mobile,1200.0,1200.000000,1200.0,1200.0,1